CREATE DATABASE  IF NOT EXISTS `bookshop` /*!40100 DEFAULT CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci */ /*!80016 DEFAULT ENCRYPTION='N' */;
USE `bookshop`;
-- MySQL dump 10.13  Distrib 8.0.29, for Win64 (x86_64)
--
-- Host: localhost    Database: bookshop
-- ------------------------------------------------------
-- Server version	8.0.25

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `author`
--

DROP TABLE IF EXISTS `author`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `author` (
  `Код автора` int NOT NULL AUTO_INCREMENT,
  `Фамилия` varchar(45) DEFAULT NULL,
  `Имя` varchar(45) DEFAULT NULL,
  `Отчество` varchar(45) DEFAULT NULL,
  `Дата рождения` varchar(45) DEFAULT NULL,
  PRIMARY KEY (`Код автора`)
) ENGINE=InnoDB AUTO_INCREMENT=16 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `author`
--

LOCK TABLES `author` WRITE;
/*!40000 ALTER TABLE `author` DISABLE KEYS */;
INSERT INTO `author` VALUES (1,'Кэнтаро','Миура','','11-07-1966'),(2,'Атанасян','Левон','Сергеевич','08-12-1921'),(3,'Кинг','Стивен','','21-09-1947'),(4,'Пушкин','Александр','Сергеевич','26-05-1799'),(5,'Полярный','Александр','','18-09-1994'),(6,'Толстой','Лев','Николаевич','09-09-1828');
/*!40000 ALTER TABLE `author` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `books`
--

DROP TABLE IF EXISTS `books`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `books` (
  `Код книги` int NOT NULL AUTO_INCREMENT,
  `Наименование книги` varchar(45) DEFAULT NULL,
  `Год издания` int DEFAULT NULL,
  `Количество страниц` int DEFAULT NULL,
  `Жанр` int DEFAULT NULL,
  `Автор` int DEFAULT NULL,
  `Издательство` int DEFAULT NULL,
  `Стоимость` float DEFAULT NULL,
  PRIMARY KEY (`Код книги`),
  KEY `books_FK` (`Жанр`),
  KEY `books_FK_1` (`Автор`),
  KEY `books_FK_2` (`Издательство`)
) ENGINE=InnoDB AUTO_INCREMENT=34 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `books`
--

LOCK TABLES `books` WRITE;
/*!40000 ALTER TABLE `books` DISABLE KEYS */;
INSERT INTO `books` VALUES (1,'test',1999,10,5,5,3,333),(4,'Мятная сказка',NULL,NULL,5,5,3,599),(12,'Берсерк',NULL,NULL,8,1,8,1200),(13,'Оно',NULL,NULL,7,3,3,1000);
/*!40000 ALTER TABLE `books` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `clients`
--

DROP TABLE IF EXISTS `clients`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `clients` (
  `Код клиента` int NOT NULL AUTO_INCREMENT,
  `Фамилия` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci DEFAULT NULL,
  `Имя` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci DEFAULT NULL,
  `Отчество` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci DEFAULT NULL,
  `Дата рождения` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci DEFAULT NULL,
  `e-mail` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci DEFAULT NULL,
  PRIMARY KEY (`Код клиента`)
) ENGINE=InnoDB AUTO_INCREMENT=45462614 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `clients`
--

LOCK TABLES `clients` WRITE;
/*!40000 ALTER TABLE `clients` DISABLE KEYS */;
INSERT INTO `clients` VALUES (45462526,'Фролов','Андрей','Иванович','2001-07-13','gohufreilagrau-3818@yopmail.com'),(45462527,'Николаев','Даниил','Всеволодович','2001-02-09','xawugosune-1385@yopmail.com'),(45462528,'Снегирев','Макар','Иванович','1998-05-20','satrahuddusei-4458@yopmail.com'),(45462529,'Иванов','Иван','Ильич','1998-09-30','boippaxeufrepra-7093@yopmail.com'),(45462530,'Филиппова','Анна','Глебовна','1976-05-30','zapramaxesu-7741@yopmail.com'),(45462531,'Иванов','Михаил','Владимирович','1985-11-03','rouzecroummegre-3899@yopmail.com'),(45462532,'Власов','Дмитрий','Александрович','1998-08-16','ziyeuddocrabri-4748@yopmail.com'),(45462533,'Серова','Екатерина','Львовна','1984-10-23','ketameissoinnei-1951@yopmail.com'),(45462534,'Борисова','Ирина','Ивановна','1976-10-13','yipraubaponou-5849@yopmail.com'),(45462535,'Зайцев','Никита','Артёмович','1999-10-13','crapedocouca-3572@yopmail.com'),(45462536,'Медведев','Святослав','Евгеньевич','1985-07-12','ceigoixakaunni-9227@yopmail.com'),(45462537,'Коротков','Кирилл','Алексеевич','1976-05-25','yeimmeiwauzomo-7054@yopmail.com'),(45462538,'Калашникова','Арина','Максимовна','1999-08-12','poleifenevi-1560@yopmail.com'),(45462539,'Минина','Таисия','Кирилловна','1985-10-12','kauprezofautei-6607@yopmail.com'),(45462540,'Наумов','Серафим','Романович','1999-04-14','quaffaullelourei-1667@yopmail.com'),(45462541,'Воробьева','Василиса','Евгеньевна','1999-01-12','jsteele@rojas-robinson.net'),(45462542,'Калинин','Александр','Андреевич','1999-01-06','vhopkins@lewis-mullen.com'),(45462543,'Кузнецова','Милана','Владиславовна','1999-01-23','nlewis@yahoo.com'),(45462544,'Фирсов','Егор','Романович','1993-09-01','garciadavid@mckinney-mcbride.com'),(45462545,'Зимина','Агния','Александровна','1998-09-02','cbradley@castro.com'),(45462546,'Титов','Андрей','Глебович','1985-10-22','cuevascatherine@carlson.biz'),(45462547,'Орлов','Николай','Егорович','1985-07-26','thomasmoore@wilson-singh.net'),(45462548,'Кузнецова','Аиша','Михайловна','1998-10-03','jessica84@hotmail.com'),(45462549,'Куликов','Никита','Георгиевич','1999-04-22','jessicapark@hotmail.com'),(45462550,'Карпова','София','Егоровна','1993-09-30','ginaritter@schneider-buchanan.com'),(45462551,'Смирнова','Дарья','Макаровна','1976-03-21','stephen99@yahoo.com'),(45462552,'Абрамова','Александра','Мироновна','1999-03-25','lopezlisa@hotmail.com'),(45462553,'Наумов','Руслан','Михайлович','1999-10-10','lori17@hotmail.com'),(45462554,'Бочаров','Никита','Матвеевич','1997-06-28','campbellkevin@gardner.com'),(45462555,'Соловьев','Давид','Ильич','1984-03-05','morganhoward@clark.com'),(45462556,'Васильева','Валерия','Дмитриевна','1999-09-29','carsontamara@gmail.com'),(45462557,'Макарова','Василиса','Андреевна','1999-04-07','kevinpatel@gmail.com'),(45462558,'Алексеев','Матвей','Викторович','1998-08-01','sethbishop@yahoo.com'),(45462559,'Никитина','Полина','Александровна','1976-09-18','drollins@schultz-soto.net'),(45462560,'Окулова','Олеся','Алексеевна','1999-04-02','pblack@copeland-winters.org'),(45462561,'Захарова','Полина','Яновна','1976-04-20','johnathon.oberbrunner@yahoo.com'),(45462562,'Зайцев','Владимир','Давидович','1998-01-25','bradly29@gmail.com'),(45462563,'Иванов','Виталий','Даниилович','1976-08-10','stark.cristina@hilpert.biz'),(45462564,'Захаров','Матвей','Романович','1993-07-11','bruen.eleanore@yahoo.com'),(45462565,'Иванов','Степан','Степанович','1998-09-18','percival.halvorson@yahoo.com'),(45462566,'Ткачева','Милана','Тимуровна','1998-05-23','javonte71@kuhlman.biz'),(45462567,'Семенов','Даниил','Иванович','1976-01-03','vconnelly@kautzer.com'),(45462568,'Виноградов','Вячеслав','Дмитриевич','1976-07-11','anabelle07@schultz.info'),(45462569,'Соболева','Николь','Фёдоровна','1976-05-01','nitzsche.katlynn@yahoo.com'),(45462570,'Тихонова','Анна','Львовна','1985-03-22','corine16@von.com'),(45462571,'Кузнецова','Ульяна','Савельевна','1999-06-02','otha.wisozk@lubowitz.org'),(45462572,'Смирнова','Анна','Германовна','1997-07-17','may.kirlin@hotmail.com'),(45462573,'Черепанова','Анна','Давидовна','1985-11-05','bryana.kautzer@yahoo.com'),(45462574,'Григорьев','Максим','Кириллович','1999-05-25','deborah.christiansen@quigley.biz'),(45462575,'Голубев','Даниэль','Александрович','1999-06-13','connelly.makayla@yahoo.com'),(45462576,'Миронов','Юрий','Денисович','1985-01-25','tatum.collins@fay.org'),(45462577,'Терехов','Михаил','Андреевич','1976-07-05','itzel73@anderson.com'),(45462578,'Орлова','Алиса','Михайловна','1997-02-23','arjun39@hotmail.com'),(45462579,'Кулаков','Константин','Даниилович','1993-06-19','ohara.rebeka@yahoo.com'),(45462580,'Кудрявцев','Максим','Романович','1998-05-09','danika58@rath.com'),(45462581,'Соболева','Кира','Фёдоровна','1998-03-13','janae.bogan@gmail.com'),(45462582,'Коновалов','Арсений','Максимович','1985-02-17','vern91@yahoo.com'),(45462583,'Гусев','Михаил','Дмитриевич','1999-11-22','mariana.leannon@larkin.net'),(45462584,'Суханова','Варвара','Матвеевна','1993-09-12','vmoore@gmail.com'),(45462585,'Орлова','Ясмина','Васильевна','1984-06-23','damon.mcclure@mills.com'),(45462586,'Васильева','Ксения','Константиновна','1999-07-31','grady.reilly@block.com'),(45462587,'Борисова','Тамара','Данииловна','1993-05-28','boyd.koss@yahoo.com'),(45462588,'Дмитриев','Мирон','Ильич','1985-04-12','obartell@franecki.info'),(45462589,'Лебедева','Анна','Александровна','1985-03-29','reina75@ferry.net'),(45462590,'Пономарев','Артём','Маркович','1984-06-01','karson28@hotmail.com'),(45462591,'Борисова','Елена','Михайловна','1976-05-22','damaris61@okon.com'),(45462592,'Моисеев','Камиль','Максимович','1999-06-16','carroll.jerod@hotmail.com'),(45462593,'Герасимова','Дарья','Константиновна','1984-10-12','ron.treutel@quitzon.com'),(45462594,'Михайлова','Мария','Марковна','1976-12-01','olen79@yahoo.com'),(45462595,'Коршунов','Кирилл','Максимович','1985-05-21','pacocha.robbie@yahoo.com');
/*!40000 ALTER TABLE `clients` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `employees`
--

DROP TABLE IF EXISTS `employees`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `employees` (
  `Код сотрудника` int NOT NULL AUTO_INCREMENT,
  `Фамилия` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci DEFAULT NULL,
  `Имя` varchar(100) DEFAULT NULL,
  `Отчество` varchar(100) DEFAULT NULL,
  `Должность` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci DEFAULT NULL,
  `Логин` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci DEFAULT NULL,
  `Пароль` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci DEFAULT NULL,
  `Последний вход` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci DEFAULT NULL,
  `Тип входа` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci DEFAULT NULL,
  `Фото` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci DEFAULT NULL,
  PRIMARY KEY (`Код сотрудника`)
) ENGINE=InnoDB AUTO_INCREMENT=112 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `employees`
--

LOCK TABLES `employees` WRITE;
/*!40000 ALTER TABLE `employees` DISABLE KEYS */;
INSERT INTO `employees` VALUES (101,'Иванов','Иван','Иванович','Продавец','Ivanov@namecomp.ru','2L6KZG','03.03.2023 23:39:56','Успешно','Иванов.jpeg'),(102,'Петров','Петр','Петрович','Продавец','petrov@namecomp.ru','uzWC67','03.03.2023 23:39:56','Успешно','Петров.jpeg'),(103,'Федоров','Федор','Федорович','Администратор','fedorov@namecomp.ru','8ntwUp','03.03.2023 23:39:56','Успешно','Федоров.jpeg'),(104,'Миронов','Вениамин','Куприянович','Старший смены','mironov@namecomp.ru','YOyhfR','03.03.2023 23:39:56','Неуспешно','Миронов.jpeg'),(105,'Ширяев','Ермолай','Вениаминович','Старший смены','shiryev@namecomp.ru','RSbvHv','03.03.2023 23:39:56','Неуспешно','Ширяев.jpeg'),(106,'Игнатов','Кассиан','Васильевич','Старший смены','ignatov@namecomp.ru','rwVDh9','03.03.2023 23:39:56','Успешно','Игнатов.jpg'),(107,'Хохлов','Владимир','Мэлсович','Продавец','hohlov@namecomp.ru','LdNyos','03.03.2023 23:39:56','Успешно','Хохлов.jpeg'),(108,'Стрелков','Мстислав','Георгьевич','Продавец','strelkov@namecomp.ru','gynQMT','03.03.2023 23:39:56','Успешно','Стрелков.jpeg'),(109,'Беляева','Лилия','Наумовна','Продавец','belyeva@namecomp.ru','AtnDjr','03.03.2023 23:39:56','Успешно','Беляева.jpeg'),(110,'Смирнова','Ульяна','Гордеевна','Продавец','smirnova@namecomp.ru','JlFRCZ','03.03.2023 23:39:56','Успешно','Смирнова.jpeg'),(111,'test','test','test','Администратор','1','1','26.04.2023 15:08:48','Успешно',NULL);
/*!40000 ALTER TABLE `employees` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `genre`
--

DROP TABLE IF EXISTS `genre`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `genre` (
  `Код жанра` int NOT NULL AUTO_INCREMENT,
  `Жанр` varchar(45) DEFAULT NULL,
  PRIMARY KEY (`Код жанра`)
) ENGINE=InnoDB AUTO_INCREMENT=38 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `genre`
--

LOCK TABLES `genre` WRITE;
/*!40000 ALTER TABLE `genre` DISABLE KEYS */;
INSERT INTO `genre` VALUES (1,'Классика'),(2,'Фантастика'),(3,'Детектив'),(4,'Учебная литература'),(5,'Сказка'),(6,'Фэнтези'),(7,'Роман'),(8,'Манга'),(9,'Мемуары'),(10,'Религия'),(11,'Психология'),(12,'Философия'),(13,'Детская литература'),(14,'Комиксы'),(15,'Проза'),(16,'Поэзия'),(17,'Драматургия'),(18,'Художественная литература'),(19,'Экономия'),(20,'Право'),(21,'Справочник'),(22,'Медицина');
/*!40000 ALTER TABLE `genre` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `history`
--

DROP TABLE IF EXISTS `history`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `history` (
  `ID` int NOT NULL AUTO_INCREMENT,
  `Дата входа` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci DEFAULT NULL,
  `Дата выхода` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci DEFAULT NULL,
  `Блокировка` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci DEFAULT NULL,
  `Логин сотрудника` int NOT NULL,
  PRIMARY KEY (`ID`),
  KEY `history_FK` (`Логин сотрудника`),
  CONSTRAINT `history_FK` FOREIGN KEY (`Логин сотрудника`) REFERENCES `employees` (`Код сотрудника`)
) ENGINE=InnoDB AUTO_INCREMENT=427 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `history`
--

LOCK TABLES `history` WRITE;
/*!40000 ALTER TABLE `history` DISABLE KEYS */;
INSERT INTO `history` VALUES (54,'28:02:2023 21:26:21',NULL,'1',101),(55,'28:02:2023 21:28:42',NULL,'1',101),(56,'28:02:2023 21:28:56',NULL,'1',101),(57,'28:02:2023 21:29:52',NULL,'1',101),(58,'28:02:2023 21:30:46',NULL,'1',101),(59,'28:02:2023 21:30:57',NULL,'1',101),(60,'28:02:2023 21:31:53',NULL,'1',101),(61,'28:02:2023 21:44:06',NULL,'1',101),(62,'28:02:2023 21:44:34',NULL,'1',101),(63,'28:02:2023 21:46:23',NULL,'1',101),(64,'28:02:2023 21:47:30',NULL,'1',101),(65,'28:02:2023 21:47:51',NULL,'1',101),(66,'28:02:2023 21:48:50',NULL,'1',101),(67,'28:02:2023 21:49:19',NULL,'1',101),(68,'28:02:2023 21:51:22',NULL,'1',101),(69,'28:02:2023 21:52:34',NULL,'1',101),(70,'28:02:2023 21:52:58',NULL,'1',101),(71,'28:02:2023 21:54:03',NULL,'1',101),(72,'28:02:2023 21:54:31',NULL,'1',101),(73,NULL,'28:02:2023 21:54:31','0',101),(74,'28:02:2023 21:54:53',NULL,'1',103),(75,'28:02:2023 22:00:14',NULL,'1',103),(76,'28:02:2023 22:15:32',NULL,'1',103),(77,'28:02:2023 22:15:54',NULL,'1',103),(78,'28:02:2023 22:24:19',NULL,'1',103),(79,'28:02:2023 22:24:38',NULL,'1',103),(80,'28:02:2023 22:25:26',NULL,'1',103),(81,'28:02:2023 22:26:08',NULL,'1',103),(82,'28:02:2023 22:26:54',NULL,'1',103),(83,'28:02:2023 22:27:31',NULL,'1',103),(84,'01:03:2023 00:20:47',NULL,'1',103),(85,'01:03:2023 00:21:29',NULL,'1',103),(86,'01:03:2023 00:35:07',NULL,'1',103),(87,'01:03:2023 00:37:49',NULL,'1',103),(88,'01:03:2023 00:38:57',NULL,'1',103),(89,'01:03:2023 00:39:14',NULL,'1',103),(90,'01:03:2023 00:43:05',NULL,'1',103),(91,'01:03:2023 00:43:20',NULL,'1',103),(92,'01:03:2023 00:43:49',NULL,'1',103),(93,'01:03:2023 00:44:09',NULL,'1',103),(94,'01:03:2023 00:46:57',NULL,'1',103),(95,'01:03:2023 00:48:53',NULL,'1',103),(96,'01:03:2023 00:49:54',NULL,'1',103),(97,'01:03:2023 00:50:11',NULL,'1',103),(98,'01:03:2023 00:58:14',NULL,'1',103),(99,'01:03:2023 00:58:31',NULL,'1',103),(100,'01:03:2023 00:59:11',NULL,'1',103),(101,'01:03:2023 01:02:24',NULL,'1',103),(102,'01:03:2023 01:04:19',NULL,'1',103),(103,'01:03:2023 01:07:08',NULL,'1',103),(104,'01:03:2023 01:08:21',NULL,'1',103),(105,'01:03:2023 01:08:54',NULL,'1',103),(106,'01:03:2023 01:09:34',NULL,'1',103),(107,'01:03:2023 01:10:00',NULL,'1',103),(108,'01:03:2023 01:14:32',NULL,'1',103),(109,'01:03:2023 01:15:24',NULL,'1',103),(110,'01:03:2023 01:18:15',NULL,'1',103),(111,'01:03:2023 01:19:50',NULL,'1',103),(112,'01:03:2023 01:22:04',NULL,'1',103),(113,'01:03:2023 10:08:26',NULL,'1',103),(114,'01:03:2023 10:09:00',NULL,'1',101),(115,'01:03:2023 10:12:10',NULL,'1',103),(116,'01:03:2023 10:13:01',NULL,'1',101),(117,'01:03:2023 10:15:17',NULL,'1',101),(118,'01:03:2023 10:17:29',NULL,'1',101),(119,'01:03:2023 10:19:18',NULL,'1',101),(120,'02:03:2023 11:05:13',NULL,'1',101),(121,'02:03:2023 11:06:37',NULL,'1',101),(122,NULL,'02:03:2023 11:07:06','0',101),(123,'02:03:2023 11:07:41',NULL,'1',103),(124,'02:03:2023 14:02:11',NULL,'0',101),(125,'02:03:2023 14:02:26',NULL,'1',101),(126,NULL,'02:03:2023 14:02:54','0',101),(127,'02:03:2023 14:03:01',NULL,'1',103),(128,'02:03:2023 15:23:07',NULL,'1',103),(129,'02:03:2023 15:47:20',NULL,'1',103),(130,'02:03:2023 15:48:16',NULL,'1',103),(131,'02:03:2023 15:48:33',NULL,'1',103),(132,'02:03:2023 15:48:59',NULL,'1',103),(133,'02:03:2023 15:49:16',NULL,'1',103),(134,'02:03:2023 15:50:26',NULL,'1',103),(135,'02:03:2023 15:50:40',NULL,'1',103),(136,'02:03:2023 15:51:24',NULL,'1',103),(137,'02:03:2023 15:52:11',NULL,'1',103),(138,'04:03:2023 10:24:40',NULL,'1',103),(139,'04:03:2023 10:30:27',NULL,'1',103),(140,'04:03:2023 10:33:12',NULL,'1',103),(141,'04:03:2023 11:04:44',NULL,'1',103),(142,'04:03:2023 11:08:44',NULL,'1',103),(143,'04:03:2023 11:17:14',NULL,'1',103),(144,'04:03:2023 11:17:49',NULL,'1',103),(145,'04:03:2023 11:21:10',NULL,'1',103),(146,'04:03:2023 11:21:57',NULL,'1',103),(147,'04:03:2023 11:22:46',NULL,'1',103),(148,'04:03:2023 11:23:34',NULL,'1',103),(149,'04:03:2023 11:24:24',NULL,'1',103),(150,'04:03:2023 11:24:44',NULL,'1',103),(151,'04:03:2023 11:25:49',NULL,'1',103),(152,'04:03:2023 11:26:58',NULL,'1',103),(153,'04:03:2023 11:27:21',NULL,'1',103),(154,'04:03:2023 11:28:01',NULL,'1',103),(155,'04:03:2023 11:29:21',NULL,'1',103),(156,'04:03:2023 11:30:04',NULL,'1',103),(157,'04:03:2023 11:30:57',NULL,'1',103),(158,'04:03:2023 11:33:03',NULL,'1',103),(159,'04:03:2023 11:42:50',NULL,'1',103),(160,NULL,'04:03:2023 11:46:28','0',103),(161,'04:03:2023 11:46:37',NULL,'1',101),(162,'04:03:2023 11:47:24',NULL,'1',101),(163,'04:03:2023 11:51:35',NULL,'1',101),(164,'04:03:2023 11:52:26',NULL,'1',101),(165,'04:03:2023 11:53:57',NULL,'1',101),(166,'04:03:2023 11:55:34',NULL,'1',101),(167,'04:03:2023 11:56:12',NULL,'1',101),(168,'04:03:2023 11:56:27',NULL,'1',101),(169,'04:03:2023 11:59:08',NULL,'1',101),(170,'04:03:2023 11:59:34',NULL,'1',101),(171,'04:03:2023 11:59:54',NULL,'1',101),(172,NULL,'04:03:2023 12:00:45','0',101),(173,'04:03:2023 12:01:02',NULL,'1',101),(174,NULL,'04:03:2023 12:03:30','0',101),(175,'04:03:2023 12:03:39',NULL,'1',103),(176,NULL,'04:03:2023 12:04:15','0',103),(177,'04:03:2023 12:04:26',NULL,'1',101),(178,'04:03:2023 15:43:18',NULL,'1',101),(179,'04:03:2023 15:46:22',NULL,'1',101),(180,'04:03:2023 19:58:12',NULL,'1',103),(181,'04:03:2023 20:00:03',NULL,'1',103),(182,'04:03:2023 20:04:57',NULL,'1',103),(183,'04:03:2023 20:07:53',NULL,'1',103),(184,'04:03:2023 20:08:20',NULL,'1',103),(185,'04:03:2023 20:09:03',NULL,'1',103),(186,'04:03:2023 20:09:23',NULL,'1',103),(187,'04:03:2023 20:10:38',NULL,'1',103),(188,'04:03:2023 20:11:01',NULL,'1',103),(189,'04:03:2023 20:11:37',NULL,'1',103),(190,'04:03:2023 20:13:26',NULL,'1',103),(191,'04:03:2023 20:14:31',NULL,'1',103),(192,'04:03:2023 20:14:56',NULL,'1',103),(193,'04:03:2023 20:15:35',NULL,'1',103),(194,'04:03:2023 23:33:33',NULL,'1',103),(195,'04:03:2023 23:33:52',NULL,'1',103),(196,'04:03:2023 23:39:09',NULL,'1',103),(197,'04:03:2023 23:39:55',NULL,'1',103),(198,NULL,'04.03.2023 23:39:56','0',103),(199,'04.03.2023 23:44:10',NULL,'1',103),(200,'05.03.2023 00:05:58',NULL,'1',103),(201,'05.03.2023 00:20:20',NULL,'1',103),(202,'05.03.2023 00:25:42',NULL,'1',103),(203,'05.03.2023 00:29:39',NULL,'1',103),(204,'05.03.2023 00:29:50',NULL,'1',103),(205,'05.03.2023 00:31:15',NULL,'1',103),(206,'05.03.2023 00:31:58',NULL,'1',103),(207,'05.03.2023 00:33:30',NULL,'1',103),(208,NULL,'05.03.2023 00:33:31','0',103),(209,'05.03.2023 00:35:33',NULL,'1',104),(210,NULL,'05.03.2023 00:35:34','0',104),(211,'05.03.2023 01:19:01',NULL,'1',104),(212,NULL,'05.03.2023 01:19:05','0',104),(213,'05.03.2023 01:19:51',NULL,'0',110),(214,'05.03.2023 01:19:52',NULL,'0',110),(215,'05.03.2023 01:19:58',NULL,'0',110),(216,'05.03.2023 01:26:25',NULL,'0',110),(217,'05.03.2023 01:30:53',NULL,'1',110),(218,NULL,'05.03.2023 01:31:02','0',110),(219,'05.03.2023 01:34:42',NULL,'0',110),(220,'05.03.2023 01:36:27',NULL,'Неуспешно',109),(221,'05.03.2023 01:37:01',NULL,'Успешно',103),(222,NULL,'05.03.2023 01:37:12','Неуспешно',103),(223,'05.03.2023 01:50:11',NULL,'Успешно',103),(224,'05.03.2023 01:51:40',NULL,'Успешно',103),(225,'05.03.2023 01:55:45',NULL,'Успешно',103),(226,NULL,'05.03.2023 01:56:26','Неуспешно',103),(227,'05.03.2023 02:01:58',NULL,'Успешно',103),(228,'05.03.2023 02:12:04',NULL,'Успешно',103),(229,'05.03.2023 02:12:47',NULL,'Успешно',103),(230,'05.03.2023 02:15:04',NULL,'Успешно',103),(231,'05.03.2023 02:18:12',NULL,'Успешно',103),(232,'05.03.2023 02:19:22',NULL,'Успешно',103),(233,NULL,'05.03.2023 02:21:57','Неуспешно',103),(234,'05.03.2023 02:23:28',NULL,'Успешно',103),(235,'05.03.2023 02:25:05',NULL,'Успешно',103),(236,'05.03.2023 02:29:51',NULL,'Успешно',103),(237,'05.03.2023 02:30:22',NULL,'Успешно',103),(238,'05.03.2023 02:31:18',NULL,'Успешно',103),(239,'05.03.2023 02:34:24',NULL,'Успешно',103),(240,'05.03.2023 02:35:36',NULL,'Успешно',103),(241,'05.03.2023 02:38:43',NULL,'Успешно',103),(242,NULL,'05.03.2023 02:38:56','Неуспешно',103),(243,'05.03.2023 02:43:13',NULL,'Успешно',103),(244,'05.03.2023 02:43:45',NULL,'Успешно',103),(245,'05.03.2023 02:44:39',NULL,'Успешно',103),(246,'05.03.2023 14:01:41',NULL,'Успешно',103),(247,'05.03.2023 14:04:24',NULL,'Успешно',103),(248,'05.03.2023 14:05:56',NULL,'Успешно',103),(249,'05.03.2023 14:07:39',NULL,'Успешно',103),(250,'05.03.2023 14:10:51',NULL,'Успешно',103),(251,'05.03.2023 14:13:03',NULL,'Успешно',103),(252,'05.03.2023 14:22:08',NULL,'Успешно',103),(253,'05.03.2023 14:22:53',NULL,'Успешно',103),(254,'05.03.2023 14:23:39',NULL,'Успешно',103),(255,NULL,'05.03.2023 14:28:35','Неуспешно',103),(256,'05.03.2023 14:29:19',NULL,'Успешно',103),(257,'05.03.2023 14:38:05',NULL,'Успешно',103),(258,'05.03.2023 14:39:00',NULL,'Успешно',103),(259,'05.03.2023 14:39:40',NULL,'Успешно',103),(260,'05.03.2023 14:43:39',NULL,'Успешно',103),(261,NULL,'05.03.2023 14:43:58','Неуспешно',103),(262,'05.03.2023 14:44:33',NULL,'Успешно',103),(263,NULL,'05.03.2023 14:45:00','Неуспешно',103),(264,'05.03.2023 14:45:43',NULL,'Успешно',103),(265,NULL,'05.03.2023 14:46:06','Неуспешно',103),(266,'05.03.2023 14:46:41',NULL,'Успешно',103),(267,'05.03.2023 14:49:34',NULL,'Успешно',103),(268,'05.03.2023 15:21:02',NULL,'Успешно',103),(269,'05.03.2023 15:30:52',NULL,'Успешно',103),(270,'05.03.2023 15:33:55',NULL,'Успешно',103),(271,'05.03.2023 15:34:32',NULL,'Успешно',103),(272,'05.03.2023 15:35:51',NULL,'Успешно',103),(273,'05.03.2023 15:41:36',NULL,'Успешно',103),(274,'05.03.2023 15:43:28',NULL,'Успешно',103),(275,'05.03.2023 15:45:14',NULL,'Успешно',103),(276,'05.03.2023 15:46:31',NULL,'Успешно',103),(277,'05.03.2023 15:47:38',NULL,'Успешно',103),(278,'05.03.2023 15:48:47',NULL,'Успешно',103),(279,'05.03.2023 15:53:31',NULL,'Успешно',103),(280,NULL,'05.03.2023 15:54:56','Неуспешно',103),(281,'05.03.2023 15:55:41',NULL,'Успешно',103),(282,'05.03.2023 15:59:07',NULL,'Успешно',103),(283,'05.03.2023 16:00:08',NULL,'Успешно',103),(284,'05.03.2023 16:00:47',NULL,'Успешно',103),(285,NULL,'05.03.2023 17:08:05','Неуспешно',103),(286,'05.03.2023 17:09:40',NULL,'Успешно',103),(287,'05.03.2023 17:11:02',NULL,'Успешно',103),(288,'05.03.2023 20:48:43',NULL,'Успешно',103),(289,NULL,'05.03.2023 20:49:10','Неуспешно',103),(290,'07.03.2023 11:08:37',NULL,'Успешно',103),(291,'07.03.2023 11:09:25',NULL,'Успешно',103),(292,'07.03.2023 11:10:21',NULL,'Успешно',103),(293,'07.03.2023 12:10:19',NULL,'Успешно',103),(294,'07.03.2023 12:11:11',NULL,'Успешно',103),(295,'07.03.2023 12:11:36',NULL,'Успешно',103),(296,'07.03.2023 12:12:17',NULL,'Успешно',102),(297,'07.03.2023 12:32:11',NULL,'Успешно',101),(298,'07.03.2023 12:35:05',NULL,'Успешно',103),(299,'07.03.2023 12:35:41',NULL,'Успешно',103),(300,'07.03.2023 12:37:30',NULL,'Успешно',103),(301,NULL,'07.03.2023 12:37:56','Неуспешно',103),(302,'07.03.2023 12:40:00',NULL,'Успешно',103),(303,'07.03.2023 12:41:46',NULL,'Успешно',103),(304,'07.03.2023 12:42:13',NULL,'Успешно',103),(305,'07.03.2023 12:43:30',NULL,'Успешно',103),(306,'07.03.2023 12:45:37',NULL,'Успешно',101),(307,'07.03.2023 12:45:56',NULL,'Успешно',102),(308,'07.03.2023 12:47:03',NULL,'Успешно',107),(309,'07.03.2023 12:47:23',NULL,'Успешно',108),(310,'07.03.2023 12:47:52',NULL,'Успешно',109),(311,'07.03.2023 12:48:41',NULL,'Успешно',101),(312,'07.03.2023 12:49:01',NULL,'Успешно',102),(313,'07.03.2023 13:01:44',NULL,'Успешно',110),(314,'07.03.2023 13:08:35',NULL,'Успешно',109),(315,'07.03.2023 13:08:50',NULL,'Успешно',110),(316,'07.03.2023 13:09:43',NULL,'Успешно',101),(317,'07.03.2023 13:10:29',NULL,'Успешно',102),(318,'07.03.2023 13:11:02',NULL,'Успешно',107),(319,'07.03.2023 13:11:37',NULL,'Успешно',102),(320,NULL,'07.03.2023 13:12:19','Неуспешно',102),(321,'07.03.2023 13:13:09',NULL,'Успешно',103),(322,'07.03.2023 13:13:54',NULL,'Успешно',103),(323,NULL,'07.03.2023 13:14:20','Неуспешно',103),(324,'07.03.2023 13:21:21',NULL,'Успешно',103),(325,NULL,'07.03.2023 13:22:13','Неуспешно',103),(326,'07.03.2023 13:47:04',NULL,'Успешно',103),(327,'07.03.2023 13:48:25',NULL,'Успешно',103),(328,'07.03.2023 13:51:03',NULL,'Успешно',103),(329,'07.03.2023 13:51:40',NULL,'Успешно',103),(330,'07.03.2023 14:19:58',NULL,'Успешно',103),(331,'07.03.2023 14:20:39',NULL,'Успешно',103),(332,'07.03.2023 14:22:18',NULL,'Успешно',103),(333,'07.03.2023 14:23:02',NULL,'Успешно',103),(334,'07.03.2023 14:23:39',NULL,'Успешно',103),(335,NULL,'07.03.2023 21:35:49','Неуспешно',103),(336,'09.03.2023 00:59:10',NULL,'Успешно',103),(337,'09.03.2023 01:00:49',NULL,'Успешно',103),(338,'09.03.2023 01:01:33',NULL,'Успешно',103),(339,NULL,'09.03.2023 01:03:13','Неуспешно',103),(340,'09.03.2023 01:03:31',NULL,'Успешно',103),(341,'09.03.2023 01:09:24',NULL,'Успешно',103),(342,'09.03.2023 01:22:47',NULL,'Успешно',103),(343,'09.03.2023 01:24:15',NULL,'Успешно',103),(344,'09.03.2023 01:26:12',NULL,'Успешно',103),(345,'09.03.2023 01:27:42',NULL,'Успешно',103),(346,NULL,'09.03.2023 01:28:22','Неуспешно',103),(347,'09.03.2023 01:28:50',NULL,'Успешно',103),(348,NULL,'09.03.2023 01:29:24','Неуспешно',103),(349,NULL,'09.03.2023 01:29:28','Неуспешно',103),(350,'09.03.2023 01:31:26',NULL,'Успешно',103),(351,NULL,'09.03.2023 01:32:14','Неуспешно',103),(352,'09.03.2023 01:35:03',NULL,'Успешно',103),(353,NULL,'09.03.2023 01:35:29','Неуспешно',103),(354,'25.04.2023 21:00:37',NULL,'Успешно',103),(355,NULL,'25.04.2023 21:00:42','Неуспешно',103),(356,'25.04.2023 21:07:47',NULL,'Успешно',103),(357,NULL,'25.04.2023 21:07:57','Неуспешно',103),(358,'25.04.2023 21:49:59',NULL,'Успешно',103),(359,NULL,'25.04.2023 21:50:25','Неуспешно',103),(360,'26.04.2023 01:42:32',NULL,'Успешно',103),(361,NULL,'26.04.2023 01:44:32','Неуспешно',103),(362,'26.04.2023 01:55:09',NULL,'Успешно',103),(363,NULL,'26.04.2023 01:55:41','Неуспешно',103),(364,'26.04.2023 02:21:05',NULL,'Успешно',103),(365,'26.04.2023 02:23:13',NULL,'Успешно',103),(366,'26.04.2023 02:24:39',NULL,'Успешно',103),(367,'26.04.2023 02:28:30',NULL,'Успешно',103),(368,NULL,'26.04.2023 02:32:02','Неуспешно',103),(369,'26.04.2023 02:39:38',NULL,'Успешно',103),(370,NULL,'26.04.2023 02:39:51','Неуспешно',103),(371,'26.04.2023 03:04:54',NULL,'Успешно',111),(372,'26.04.2023 03:06:07',NULL,'Успешно',111),(373,'26.04.2023 03:07:12',NULL,'Успешно',111),(374,'26.04.2023 03:07:55',NULL,'Успешно',111),(375,NULL,'26.04.2023 03:08:31','Неуспешно',111),(376,'26.04.2023 03:09:11',NULL,'Успешно',111),(377,'26.04.2023 03:10:14',NULL,'Успешно',111),(378,'26.04.2023 03:10:39',NULL,'Успешно',111),(379,'26.04.2023 03:11:35',NULL,'Успешно',111),(380,'26.04.2023 03:12:45',NULL,'Успешно',111),(381,'26.04.2023 03:13:34',NULL,'Успешно',111),(382,'26.04.2023 03:14:31',NULL,'Успешно',111),(383,'26.04.2023 03:16:35',NULL,'Успешно',111),(384,NULL,'26.04.2023 03:17:26','Неуспешно',111),(385,'26.04.2023 03:18:54',NULL,'Успешно',111),(386,'26.04.2023 03:20:20',NULL,'Успешно',111),(387,'26.04.2023 03:24:38',NULL,'Успешно',111),(388,'26.04.2023 03:25:14',NULL,'Успешно',111),(389,'26.04.2023 03:26:33',NULL,'Успешно',111),(390,NULL,'26.04.2023 03:26:51','Неуспешно',111),(391,'26.04.2023 14:13:17',NULL,'Успешно',111),(392,'26.04.2023 14:14:42',NULL,'Успешно',111),(393,NULL,'26.04.2023 14:15:01','Неуспешно',111),(394,'26.04.2023 14:15:47',NULL,'Успешно',111),(395,'26.04.2023 14:16:34',NULL,'Успешно',111),(396,'26.04.2023 14:17:31',NULL,'Успешно',111),(397,'26.04.2023 14:17:58',NULL,'Успешно',111),(398,NULL,'26.04.2023 14:18:14','Неуспешно',111),(399,'26.04.2023 14:18:45',NULL,'Успешно',111),(400,'26.04.2023 14:20:26',NULL,'Успешно',111),(401,'26.04.2023 14:21:42',NULL,'Успешно',111),(402,'26.04.2023 14:22:51',NULL,'Успешно',111),(403,'26.04.2023 14:23:29',NULL,'Успешно',111),(404,'26.04.2023 14:26:11',NULL,'Успешно',111),(405,'26.04.2023 14:27:05',NULL,'Успешно',111),(406,'26.04.2023 14:28:08',NULL,'Успешно',111),(407,'26.04.2023 14:28:55',NULL,'Успешно',111),(408,'26.04.2023 14:30:28',NULL,'Успешно',111),(409,'26.04.2023 14:30:55',NULL,'Успешно',111),(410,'26.04.2023 14:32:07',NULL,'Успешно',111),(411,'26.04.2023 14:32:55',NULL,'Успешно',111),(412,'26.04.2023 14:35:08',NULL,'Успешно',111),(413,'26.04.2023 14:38:01',NULL,'Успешно',111),(414,'26.04.2023 14:40:17',NULL,'Успешно',111),(415,NULL,'26.04.2023 14:41:47','Неуспешно',111),(416,'26.04.2023 14:50:20',NULL,'Успешно',111),(417,NULL,'26.04.2023 14:50:30','Неуспешно',111),(418,'26.04.2023 14:52:06',NULL,'Успешно',111),(419,'26.04.2023 14:53:25',NULL,'Успешно',111),(420,'26.04.2023 15:00:54',NULL,'Успешно',111),(421,'26.04.2023 15:03:59',NULL,'Успешно',111),(422,'26.04.2023 15:05:16',NULL,'Успешно',111),(423,'26.04.2023 15:06:34',NULL,'Успешно',111),(424,'26.04.2023 15:07:06',NULL,'Успешно',111),(425,'26.04.2023 15:08:48',NULL,'Успешно',111),(426,NULL,'26.04.2023 15:09:32','Неуспешно',111);
/*!40000 ALTER TABLE `history` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `provider`
--

DROP TABLE IF EXISTS `provider`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `provider` (
  `Код поставщика` int NOT NULL AUTO_INCREMENT,
  `Наименование компании` varchar(100) NOT NULL,
  `Юридический адрес` varchar(100) NOT NULL,
  `Номер телефона` varchar(100) NOT NULL,
  PRIMARY KEY (`Код поставщика`)
) ENGINE=InnoDB AUTO_INCREMENT=4 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `provider`
--

LOCK TABLES `provider` WRITE;
/*!40000 ALTER TABLE `provider` DISABLE KEYS */;
INSERT INTO `provider` VALUES (1,'test','test','test');
/*!40000 ALTER TABLE `provider` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `provider_order`
--

DROP TABLE IF EXISTS `provider_order`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `provider_order` (
  `Код поставки` int NOT NULL AUTO_INCREMENT,
  `Поставщик` int NOT NULL,
  `Дата создания` date NOT NULL,
  `Книга` int NOT NULL,
  `Количество` int NOT NULL,
  `Стоимость` float NOT NULL,
  PRIMARY KEY (`Код поставки`),
  KEY `book_idx` (`Книга`),
  KEY `provider_idx` (`Поставщик`),
  CONSTRAINT `book` FOREIGN KEY (`Книга`) REFERENCES `books` (`Код книги`),
  CONSTRAINT `provider` FOREIGN KEY (`Поставщик`) REFERENCES `provider` (`Код поставщика`)
) ENGINE=InnoDB AUTO_INCREMENT=7 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `provider_order`
--

LOCK TABLES `provider_order` WRITE;
/*!40000 ALTER TABLE `provider_order` DISABLE KEYS */;
INSERT INTO `provider_order` VALUES (1,1,'2026-04-20',1,50,0),(2,1,'2023-04-26',1,2,666),(3,1,'2023-04-26',1,3,999),(4,1,'2023-04-26',12,5,6000),(5,1,'2023-04-26',13,10,10000);
/*!40000 ALTER TABLE `provider_order` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `publishing_house`
--

DROP TABLE IF EXISTS `publishing_house`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `publishing_house` (
  `Код издательства` int NOT NULL AUTO_INCREMENT,
  `Название издательства` varchar(100) DEFAULT NULL,
  PRIMARY KEY (`Код издательства`)
) ENGINE=InnoDB AUTO_INCREMENT=15 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `publishing_house`
--

LOCK TABLES `publishing_house` WRITE;
/*!40000 ALTER TABLE `publishing_house` DISABLE KEYS */;
INSERT INTO `publishing_house` VALUES (1,'Bubble'),(2,'Эксмо'),(3,'ACT'),(4,'Просвещение'),(5,'Дрофа'),(6,'Питер'),(7,'Росмэн'),(8,'Square Enix'),(9,'Перо'),(10,'Фламинго');
/*!40000 ALTER TABLE `publishing_house` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `requests`
--

DROP TABLE IF EXISTS `requests`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `requests` (
  `ID` int NOT NULL AUTO_INCREMENT,
  `Код заказа` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci DEFAULT NULL,
  `Дата создания` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci DEFAULT NULL,
  `Время заказа` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci DEFAULT NULL,
  `Клиент` int DEFAULT NULL,
  `Книга` int DEFAULT NULL,
  `Сотрудник` int DEFAULT NULL,
  PRIMARY KEY (`ID`),
  KEY `requests_FK` (`Книга`),
  KEY `requests_FK_1` (`Клиент`),
  KEY `requests_FK_2` (`Сотрудник`),
  CONSTRAINT `requests_FK` FOREIGN KEY (`Книга`) REFERENCES `books` (`Код книги`),
  CONSTRAINT `requests_FK_1` FOREIGN KEY (`Клиент`) REFERENCES `clients` (`Код клиента`),
  CONSTRAINT `requests_FK_2` FOREIGN KEY (`Сотрудник`) REFERENCES `employees` (`Код сотрудника`)
) ENGINE=InnoDB AUTO_INCREMENT=44 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `requests`
--

LOCK TABLES `requests` WRITE;
/*!40000 ALTER TABLE `requests` DISABLE KEYS */;
INSERT INTO `requests` VALUES (23,'0/2023.02.28','2023.02.28','21:51',45462526,4,101),(24,'35256230/2023.02.28','2023.02.28','21:51',45462526,4,101),(25,'35256230/2023.02.28','2023.02.28','21:51',45462526,4,101),(26,'35256230/2023.02.28','2023.02.28','21:51',45462526,4,101),(27,'35256230/2023.02.28','2023.02.28','21:51',45462526,4,101),(28,'44464363/2023.03.01','2023.03.01','10:13',45462526,4,101),(29,'44464363/2023.03.01','2023.03.01','10:13',45462526,4,101),(30,'44464363/2023.03.01','2023.03.01','10:13',45462526,4,101),(31,'44464363/2023.03.01','2023.03.01','10:13',45462526,13,101),(32,'0/2023.03.01','2023.03.01','10:15',45462526,4,101),(33,'0/2023.03.01','2023.03.01','10:15',45462526,4,101),(34,'0/2023.03.01','2023.03.01','10:15',45462526,4,101),(35,'0/2023.03.01','2023.03.01','10:15',45462526,13,101),(36,'0/2023.03.01','2023.03.01','10:19',45462526,12,101),(37,'0/2023.03.01','2023.03.01','10:19',45462526,13,101),(38,'0/2023.03.01','2023.03.01','10:19',45462526,13,101),(41,'45462526/2023.03.04','2023.03.04','10:19',45462526,13,101),(42,'45462526/2023.03.07','2023.03.07','12:49',45462526,4,102);
/*!40000 ALTER TABLE `requests` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2023-04-26 15:22:57
